Merge branch 'dev' into fix/Popup+18/1.0
